dogma2u/A-discord-bot-on-ESP32/MiniMe_Discord_Bot/MiniMe_Discord_Bot.ino
/*
 MiniMe Discord bot (ESP32-S3 + SSD1327). Command list: Discord !help.

 Sketch map (top to bottom):
 1) Config, pins, NTP / Pacific DST
 2) Gateway state + 8-user presence / 24h command counts
 3) OLED dashboard, sleep, overlays (U8g2 drawStr; y = font baseline)
 4) GPIO, servo, DS18B20, NeoPixel
 5) Discord REST, public HTTP APIs, command handler
 6) Touch wake (GPIO 4) + USB VBUS ADC (GPIO 1 divider)
 7) Gateway websocket, bot Online/Idle, scheduled posts, setup / loop

 OLED sleep dims then blanks the panel only; ESP32 and Wi-Fi stay up.
 Touch is polled in loop() (no interrupt). Bot status: online on activity,
 idle after 5 min quiet; touch does not set Online.
*/
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <WebSocketsClient.h>
#include <ArduinoJson.h>
#include <Wire.h>
#include <U8g2lib.h>
#include <OneWire.h>
#include <DallasTemperature.h>
#include <Adafruit_NeoPixel.h>
#include <driver/ledc.h>
#include <WiFiUdp.h>
#include <NTPClient.h>
#include <time.h>
#include <esp_heap_caps.h>
#include <esp_idf_version.h>
// ====== USER CONFIG ======
// Local-only secrets. GitHub sketch keeps placeholders. Do not commit real values.
const char* WIFI_SSID     = "ssid";
const char* WIFI_PASSWORD = "password";
const char* BOT_TOKEN     = "bot token";
const char* WEATHER_API_KEY = "WEATHER_API_KEY";
const char* NASA_API_KEY    = "NASA_API_KEY";
const char* DEEPSEEK_API_KEY = "DEEPSEEK_API_KEY";
#define BOT_GUILD_ID "GUILD_ID"  // startup member fetch
// ====== OWNER AND CHANNEL IDS ======
const String OWNER_ID_STR        = "OWNER_ID_STR";  // GPIO / servo
const String TARGET_CHANNEL_ID  = "TARGET_CHANNEL_ID";  // commands + auto posts
const String TARGET_CHANNEL_ID1 = "TARGET_CHANNEL_ID1";  // second command channel
// Discord content max is 2000. !ask max_tokens / JSON buffer sized to fit one message.
const int DISCORD_CONTENT_MAX = 2000;
const int DEEPSEEK_MAX_TOKENS = 900;
const size_t DEEPSEEK_JSON_DOC = 12288;
// ====== GPIO CONFIG ======
// WeAct ESP32-S3-N16R8 defaults. Change here if wiring differs.
const int RGB_LED_PIN = 48;
const int PIN_SERVO   = 47;
const int PIN_SET1    = 6;
const int PIN_SET2    = 7;
const int PIN_DS18B20 = 10;
// I2C SSD1327 128x128 (GND / VCC / SCL / SDA on the module)
const int PIN_I2C_SDA = 8;
const int PIN_I2C_SCL = 9;
const int PIN_TOUCH   = 4; // TOUCH4 — wire pad here
const uint32_t TOUCH_THRESHOLD = 2000; // constant gap: trip = rolling idle avg + this
// USB 5V (VBUS) → 10k → PIN_USB_VBUS_ADC → 10k → GND. Do not feed 5V straight into the pin.
const int PIN_USB_VBUS_ADC = 1;
const uint32_t USB_VBUS_R_HI = 10000; // ohms, 5V side
const uint32_t USB_VBUS_R_LO = 10000; // ohms, GND side
const uint8_t TOUCH_AVG_N = 16;       // rolling idle window
const unsigned long USB_VBUS_READ_MS = 500;
// ====== TIME CONFIG (NTP) — US Pacific DST ======
// NTP is UTC; offset applied in updateLocalTime.
WiFiUDP ntpUDP;
const long PST_OFFSET_SEC = -28800; // UTC-8
const long PDT_OFFSET_SEC = -25200; // UTC-7
NTPClient timeClient(ntpUDP, "pool.ntp.org", 0, 60000);

int civilDayOfWeek(int year, int month, int day) { // 0 = Sunday
  static const int t[] = {0, 3, 2, 5, 0, 3, 5, 1, 4, 6, 2, 4};
  int y = year;
  if (month < 3) y--;
  return (y + y / 4 - y / 100 + y / 400 + t[month - 1] + day) % 7;
}

int nthSundayOfMonth(int year, int month, int nth) {
  int dow1 = civilDayOfWeek(year, month, 1);
  int firstSunday = 1 + ((7 - dow1) % 7);
  return firstSunday + (nth - 1) * 7;
}

bool isPacificDaylightTime(unsigned long utcEpoch) {
  time_t t = (time_t)utcEpoch;
  struct tm tmUtc;
  gmtime_r(&t, &tmUtc);
  int year = tmUtc.tm_year + 1900;
  int month = tmUtc.tm_mon + 1;
  int day = tmUtc.tm_mday;
  int hour = tmUtc.tm_hour;
  if (month < 3 || month > 11) return false;
  if (month > 3 && month < 11) return true;
  if (month == 3) {
    int startDay = nthSundayOfMonth(year, 3, 2); // 2nd Sunday, 2:00am PST = 10:00 UTC
    if (day < startDay) return false;
    if (day > startDay) return true;
    return hour >= 10;
  }
  int endDay = nthSundayOfMonth(year, 11, 1); // 1st Sunday, 2:00am PDT = 09:00 UTC
  if (day < endDay) return true;
  if (day > endDay) return false;
  return hour < 9;
}

void updateLocalTime() {
  timeClient.setTimeOffset(0);
  timeClient.update();
  unsigned long utc = timeClient.getEpochTime();
  timeClient.setTimeOffset(isPacificDaylightTime(utc) ? PDT_OFFSET_SEC : PST_OFFSET_SEC);
}
// ====== SCHEDULED & INTERVAL TASKS ======
// 4-hour sysinfo and 06:00 / 12:00 / 18:00 Pacific indoor-temp posts go to TARGET_CHANNEL_ID.
const unsigned long SYSINFO_INTERVAL_MS = 14400000UL; // 4 Hours
unsigned long lastSysInfoMillis = 0;
int lastSentHour = -1;
// ====== DISCORD GATEWAY ======
// Websocket to gateway.discord.gg. gwDoc lives in PSRAM (256KB). Do not put small TLS buffers in PSRAM.
WebSocketsClient gatewayWS;
WiFiClientSecure httpsClient;
DynamicJsonDocument* gwDoc = nullptr;
const size_t GW_DOC_PSRAM = 262144;   // 256KB
const uint32_t BOARD_PSRAM_BYTES = 8UL * 1024UL * 1024UL; // this ESP32-S3 board
bool gatewayConnected     = false;
bool identified           = false;
int  heartbeatIntervalMs   = 0;
unsigned long lastHeartbeatMillis = 0;
int lastSeq               = 0;
// Bot's own Discord status (Gateway OP 3). Not the 8-user OLED rows.
unsigned long lastBotActivityMillis = 0;
const unsigned long BOT_PRESENCE_IDLE_MS = 300000UL; // 5 minutes quiet -> Idle
uint8_t botDiscordStatus = 2; // 1=idle, 2=online
bool botDiscordStatusSent = false;
const uint32_t CPU_MHZ_ACTIVE = 240;
const uint32_t CPU_MHZ_OLED_OFF_BOT_IDLE = 80;
void noteBotActivity();
void updateBotPresenceIdle();
void sendBotPresence(const char* status, bool afk);
// ====== DISPLAY STATE ======
// EA_W128128 shifts the picture down: firmware y=0 is not glass top; y=119/127 can clip.
U8G2_SSD1327_WS_128X128_F_HW_I2C u8g2(U8G2_R0, /* reset=*/ U8X8_PIN_NONE);
void noteDisplayActivity();
void drawDashboard();

