dogma2u/A-discord-bot-on-ESP32/MiniMe_Discord_Bot/MiniMe_Discord_Bot.ino
float dashTempC = -999.0f;
float dashTempF = -999.0f;
int lastServoDeg = 45;

// ====== USER TRACKING (8 dashboard rows) ======
// REST member list at boot; Gateway presence + 24h command counts on OLED.
struct TrackedUser {
  String userId, userName;
  uint8_t status;  // 0 Off, 1 Idle, 2 On, 3 DND
  uint32_t useCount24h;
  bool active;
};
static const uint8_t MAX_TRACKED_USERS = 8;
TrackedUser trackedUsers[MAX_TRACKED_USERS];
String cachedGuildIds[3];
uint8_t cachedGuildCount = 0;
unsigned long usesWindowStartMillis = 0;
const unsigned long USES_WINDOW_MS = 86400000UL;  // 24h

uint8_t statusFromDiscord(const char* s) {
  if (!s) return 0;
  if (!strcmp(s, "online")) return 2;
  if (!strcmp(s, "idle")) return 1;
  if (!strcmp(s, "dnd")) return 3;
  return 0;  // offline / unknown
}
const char* statusToWord(uint8_t s) {
  static const char* w[] = {"Off", "Idle", "On", "DND"};
  return s < 4 ? w[s] : "Off";
}

void initTrackedUsers() {
  for (uint8_t i = 0; i < MAX_TRACKED_USERS; i++) {
    trackedUsers[i].active = false;
    trackedUsers[i].userId = "";
    trackedUsers[i].userName = "";
    trackedUsers[i].status = 0;
    trackedUsers[i].useCount24h = 0;
  }
}

void resetUseWindowIfNeeded() {
  unsigned long now = millis();
  if (usesWindowStartMillis == 0) {
    usesWindowStartMillis = now;
    return;
  }
  if (now - usesWindowStartMillis >= USES_WINDOW_MS) {
    usesWindowStartMillis = now;
    for (uint8_t i = 0; i < MAX_TRACKED_USERS; i++) {
      trackedUsers[i].useCount24h = 0;
    }
  }
}

int findUserIndex(const String& userId) {
  if (userId.length() == 0) return -1;
  for (uint8_t i = 0; i < MAX_TRACKED_USERS; i++) {
    if (trackedUsers[i].active && trackedUsers[i].userId == userId) return (int)i;
  }
  return -1;
}

int addOrPickUserSlot(const String& userId, const String& userName) {
  int idx = findUserIndex(userId);
  if (idx >= 0) {
    if (userName.length()) trackedUsers[idx].userName = userName;
    return idx;
  }

  for (uint8_t i = 0; i < MAX_TRACKED_USERS; i++) {
    if (!trackedUsers[i].active) {
      trackedUsers[i].active = true;
      trackedUsers[i].userId = userId;
      trackedUsers[i].userName = userName;
      trackedUsers[i].status = 0;
      trackedUsers[i].useCount24h = 0;
      return (int)i;
    }
  }

  // Full: overwrite lowest 24h-use slot.
  uint8_t worst = 0;
  for (uint8_t i = 1; i < MAX_TRACKED_USERS; i++) {
    if (trackedUsers[i].useCount24h < trackedUsers[worst].useCount24h) worst = i;
  }
  trackedUsers[worst].active = true;
  trackedUsers[worst].userId = userId;
  trackedUsers[worst].userName = userName;
  trackedUsers[worst].status = 0;
  trackedUsers[worst].useCount24h = 0;
  return (int)worst;
}

void recordUserUse(const String& userId, const String& userName) {
  resetUseWindowIfNeeded();
  if (userId.length() == 0) return;
  int idx = findUserIndex(userId);
  if (idx < 0) {
    idx = addOrPickUserSlot(userId, userName);
  }
  if (idx < 0) return;
  if (userName.length()) trackedUsers[idx].userName = userName;
  trackedUsers[idx].status = 2;  // command use => On on OLED
  trackedUsers[idx].useCount24h++;
  noteDisplayActivity();
}

void applyPresencesArray(JsonArray presences) {
  if (presences.isNull()) return;
  for (JsonObject p : presences) {
    const char* uid = p["user"]["id"];
    if (!uid) continue;
    int idx = findUserIndex(String(uid));
    if (idx < 0) continue;
    const char* st = p["status"] | "offline";
    uint8_t newSt = statusFromDiscord(st);
    if (trackedUsers[idx].status != newSt) {
      trackedUsers[idx].status = newSt;
    }
  }
}

void requestTrackedUserPresences() {
  if (cachedGuildCount == 0) return;
  bool any = false;
  for (uint8_t i = 0; i < MAX_TRACKED_USERS; i++) {
    if (trackedUsers[i].active && trackedUsers[i].userId.length()) {
      any = true;
      break;
    }
  }
  if (!any) return;

  for (uint8_t g = 0; g < cachedGuildCount; g++) {
    if (cachedGuildIds[g].length() < 16) continue;
    StaticJsonDocument<768> doc;
    doc["op"] = 8;
    JsonObject d = doc.createNestedObject("d");
    d["guild_id"] = cachedGuildIds[g];
    d["limit"] = 0;
    d["presences"] = true;
    JsonArray ids = d.createNestedArray("user_ids");
    for (uint8_t i = 0; i < MAX_TRACKED_USERS; i++) {
      if (trackedUsers[i].active && trackedUsers[i].userId.length()) {
        ids.add(trackedUsers[i].userId);
      }
    }
    String payload;
    serializeJson(doc, payload);
    gatewayWS.sendTXT(payload);
  }
}

void handlePresenceUpdate(JsonObject d) {
  const char* uid = d["user"]["id"];
  const char* st  = d["status"] | "offline";
  if (!uid) return;

  int idx = findUserIndex(String(uid));
  if (idx < 0) {
    String name = d["user"]["global_name"] | "";
    if (name.length() == 0) {
      name = d["user"]["username"] | "";
    }
    idx = addOrPickUserSlot(String(uid), name);
    if (idx < 0) return;
  }
  String pName = d["user"]["global_name"] | "";
  if (pName.length() == 0) {
    pName = d["user"]["username"] | "";
  }
  if (pName.length()) trackedUsers[idx].userName = pName;
  uint8_t newSt = statusFromDiscord(st);
  if (trackedUsers[idx].status != newSt) {
    trackedUsers[idx].status = newSt;
  }
}

// Transient text on OLED baselines y=119 / y=127 (!display / command status).
String transientLine1 = "";
String transientLine2 = "";
String transientLine3 = "";
unsigned long transientUntilMs = 0;

unsigned long lastDashMillis = 0;
const unsigned long DASH_REFRESH_MS = 2000;
unsigned long lastDisplayActivityMillis = 0;

// ====== TOUCH WAKE (GPIO 4) ======
// Compensated raw vs rolling idle avg + TOUCH_THRESHOLD.
unsigned long lastTouchWakeMillis = 0;
bool touchWasActive = false;
uint32_t touchIdleBuf[TOUCH_AVG_N];
uint8_t touchIdleBufCount = 0;
uint8_t touchIdleBufIdx = 0;
uint32_t touchIdleSum = 0;
uint32_t touchIdleAvg = 0;
uint32_t usbVbusRefMv = 0;
uint32_t usbVbusMvCached = 0;
uint32_t usbVbusCompLastMv = 0;
unsigned long usbVbusLastReadMs = 0;
bool displayAsleep = false;
const unsigned long DISPLAY_IDLE_MS = 60000UL; // 1 minute full brightness
const unsigned long DISPLAY_DIM_MS = 15000UL; // 15 seconds fade to off
const unsigned long TOUCH_DEBOUNCE_MS = 300;
const uint8_t DISPLAY_CONTRAST_FULL = 255;

// ====== TEMP SENSOR (DS18B20 on PIN_DS18B20) ======
OneWire oneWire(PIN_DS18B20);
DallasTemperature sensors(&oneWire);
// ====== NEOPIXEL (owner !led) ======
Adafruit_NeoPixel pixels(1, RGB_LED_PIN, NEO_GRB + NEO_KHZ800);

