dogma2u/A-discord-bot-on-ESP32/MiniMe_Discord_Bot/MiniMe_Discord_Bot.ino
// ====== FORWARD DECLARATIONS ======
bool readTemperature(float &tempC, float &tempF);
bool readHttpBodyAfterHeaders(Client& client, bool chunked, int contentLength,
                              String& outBody, unsigned long deadlineMs);
bool discordIdLooksValid(const String& id);

// ====== DISPLAY UTILS ======

void noteDisplayActivity() {
  lastDisplayActivityMillis = millis();
  if (displayAsleep) {
    displayAsleep = false;
    u8g2.setPowerSave(0);
    lastDashMillis = 0;
  }
  u8g2.setContrast(DISPLAY_CONTRAST_FULL);
}

bool touchSampleValid(uint32_t raw) {
  return raw > 0 && raw < 150000;
}

uint32_t touchTripPoint() {
  return touchIdleAvg + TOUCH_THRESHOLD;
}

uint32_t readUsbVbusMilliVolts() {
  unsigned long now = millis();
  if (usbVbusLastReadMs != 0 && (now - usbVbusLastReadMs) < USB_VBUS_READ_MS) {
    return usbVbusMvCached;
  }
  usbVbusLastReadMs = now;
  uint32_t pinMv = analogReadMilliVolts((uint8_t)PIN_USB_VBUS_ADC);
  uint32_t inst = (uint32_t)((uint64_t)pinMv * (USB_VBUS_R_HI + USB_VBUS_R_LO) / USB_VBUS_R_LO);
  if (usbVbusMvCached == 0) usbVbusMvCached = inst;
  else usbVbusMvCached = (usbVbusMvCached * 7u + inst) / 8u;
  return usbVbusMvCached;
}

// Compensated idle samples are raw * ref / V. When V steps, rescale the window so trip stays put.
void rescaleTouchIdleForVbus(uint32_t oldV, uint32_t newV) {
  if (oldV == 0 || newV == 0 || touchIdleBufCount == 0) return;
  touchIdleSum = 0;
  for (uint8_t i = 0; i < touchIdleBufCount; i++) {
    touchIdleBuf[i] = (uint32_t)((uint64_t)touchIdleBuf[i] * oldV / newV);
    touchIdleSum += touchIdleBuf[i];
  }
  touchIdleAvg = touchIdleSum / touchIdleBufCount;
}

// Scale touch raw to boot-time USB voltage so VBUS sag/swell does not walk the gap.
uint32_t compensateTouchRaw(uint32_t raw) {
  uint32_t v = readUsbVbusMilliVolts();
  if (usbVbusRefMv < 1000 || v < 1000) return raw;
  if (usbVbusCompLastMv >= 1000 && usbVbusCompLastMv != v) {
    rescaleTouchIdleForVbus(usbVbusCompLastMv, v);
  }
  usbVbusCompLastMv = v;
  return (uint32_t)((uint64_t)raw * usbVbusRefMv / v);
}

void setupUsbVbusAdc() {
  analogSetPinAttenuation(PIN_USB_VBUS_ADC, ADC_11db);
  pinMode(PIN_USB_VBUS_ADC, INPUT);
  uint32_t acc = 0;
  for (int i = 0; i < 8; i++) {
    usbVbusLastReadMs = 0;
    acc += readUsbVbusMilliVolts();
    delay(10);
  }
  usbVbusRefMv = acc / 8;
  usbVbusCompLastMv = usbVbusMvCached;
}

void touchIdlePush(uint32_t sample) {
  if (touchIdleBufCount < TOUCH_AVG_N) {
    touchIdleBuf[touchIdleBufCount++] = sample;
    touchIdleSum += sample;
  } else {
    touchIdleSum -= touchIdleBuf[touchIdleBufIdx];
    touchIdleBuf[touchIdleBufIdx] = sample;
    touchIdleSum += sample;
    touchIdleBufIdx = (uint8_t)((touchIdleBufIdx + 1) % TOUCH_AVG_N);
  }
  if (touchIdleBufCount > 0) touchIdleAvg = touchIdleSum / touchIdleBufCount;
}

void calibrateTouchIdleAvg() {
  touchIdleBufCount = 0;
  touchIdleBufIdx = 0;
  touchIdleSum = 0;
  touchIdleAvg = 0;
  for (int i = 0; i < TOUCH_AVG_N; i++) {
    uint32_t raw = (uint32_t)touchRead(PIN_TOUCH);
    if (touchSampleValid(raw)) touchIdlePush(compensateTouchRaw(raw));
    delay(25);
  }
  if (touchIdleBufCount == 0) {
    uint32_t raw = (uint32_t)touchRead(PIN_TOUCH);
    touchIdlePush(compensateTouchRaw(raw));
  }
}

void updateTouchIdleAvg(uint32_t compensated) {
  if (!touchSampleValid(compensated)) return;
  if (compensated >= touchTripPoint()) return;
  touchIdlePush(compensated);
}

void configureTouchHardware() {
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 5, 0)
  touchSetTiming(0.5f, 100); // Arduino ESP32 3.x / IDF 5.5+
#else
  touchSetCycles(1, 100);
#endif
}

void setupTouch() {
  setupUsbVbusAdc();
  configureTouchHardware();
  calibrateTouchIdleAvg();
}

bool touchIsActive() {
  uint32_t raw = (uint32_t)touchRead(PIN_TOUCH);
  uint32_t compensated = compensateTouchRaw(raw);
  if (compensated >= touchTripPoint()) return true;
  updateTouchIdleAvg(compensated);
  return false;
}

// Rising edge only — stuck trip must not keep resetting the idle timer.
void pollTouchWake() {
  bool active = touchIsActive();
  if (!active) {
    touchWasActive = false;
    return;
  }
  unsigned long now = millis();
  if (now - lastTouchWakeMillis < TOUCH_DEBOUNCE_MS) return;
  if (touchWasActive) return;
  touchWasActive = true;
  lastTouchWakeMillis = now;
  noteDisplayActivity();
}

// Idle: full 1 min, dim 15 s, then blank. Clock/RSSI/heap ticks do not count as activity.
void updateDisplaySleep() {
  if (displayAsleep) return;
  unsigned long now = millis();
  if (lastDisplayActivityMillis == 0) {
    lastDisplayActivityMillis = now;
    return;
  }

  unsigned long idle = now - lastDisplayActivityMillis;
  if (idle < DISPLAY_IDLE_MS) return;

  if (idle < DISPLAY_IDLE_MS + DISPLAY_DIM_MS) {
    unsigned long dimElapsed = idle - DISPLAY_IDLE_MS;
    uint8_t contrast = (uint8_t)(DISPLAY_CONTRAST_FULL -
      (dimElapsed * (unsigned long)DISPLAY_CONTRAST_FULL) / DISPLAY_DIM_MS);
    u8g2.setContrast(contrast);
    return;
  }

  displayAsleep = true;
  u8g2.setPowerSave(1); // panel off until touch or a real event
}

// Overlay on y=119/127; do not paint here (stack + NTP unsafe inside Gateway).
void showTransient(const String& line1, const String& line2 = "", const String& line3 = "", unsigned long durationMs = 3000) {
  noteDisplayActivity();
  transientLine1 = line1;
  transientLine2 = line2;
  transientLine3 = line3;
  transientUntilMs = millis() + durationMs;
  lastDashMillis = 0;
}

// 5x7 → 6px/char, 8px/row. drawStr y = baseline.
// y=7 header | 15 bot+date | 23 up/temp | 31 sig | 39 heap | 47 srv
// y=55..111 users | 119/127 transient
void drawDashboard() {
  u8g2.clearBuffer();
  u8g2.setFont(u8g2_font_5x7_tf);

  updateLocalTime();
  String t = timeClient.getFormattedTime();
  String gwHeader = gatewayConnected ? "GW:Good" : "GW:Bad";
  u8g2.drawStr(0, 7, "MiniMe");
  u8g2.drawStr(42, 7, gwHeader.c_str());
  int timeX = 128 - u8g2.getStrWidth(t.c_str());
  if (timeX < 0) timeX = 0;
  u8g2.drawStr(timeX, 7, t.c_str());

  {
    static const char* const DOW_NAME[] = {"Sun","Mon","Tue","Wed","Thu","Fri","Sat"};
    static const char* const MON_NAME[] = {"Jan","Feb","Mar","Apr","May","Jun",
                                           "Jul","Aug","Sep","Oct","Nov","Dec"};
    time_t localEpoch = (time_t)timeClient.getEpochTime();
    struct tm tmLocal;
    gmtime_r(&localEpoch, &tmLocal);
    char botBuf[12];
    snprintf(botBuf, sizeof(botBuf), "Bot:%-6s",
             (botDiscordStatus == 2) ? "Online" : "Idle");
    u8g2.drawStr(0, 15, botBuf);

    char dateBuf[20];
    snprintf(dateBuf, sizeof(dateBuf), "%s %s %2d %04d",
             DOW_NAME[tmLocal.tm_wday], MON_NAME[tmLocal.tm_mon],
             tmLocal.tm_mday, tmLocal.tm_year + 1900);
    // Fixed slot width so DOW column does not shift.
    const char* dateSlot = "Www Mmm 99 9999";
    int dateX = 128 - u8g2.getStrWidth(dateSlot);
    if (dateX < 0) dateX = 0;
    u8g2.drawStr(dateX, 15, dateBuf);
  }

  unsigned long uptimeSec = millis() / 1000;
  unsigned long d = uptimeSec / 86400;
  unsigned long h = (uptimeSec % 86400) / 3600;
  unsigned long m = (uptimeSec % 3600) / 60;
  if (d > 9999) d = 9999;
  char upTempBuf[32];
  if (dashTempC > -998.0f) {
    snprintf(upTempBuf, sizeof(upTempBuf), "Up:%4lud%2luh%2lum T:%3.0fF/%3.0fC",
             d, h, m, dashTempF, dashTempC);
  } else {
    snprintf(upTempBuf, sizeof(upTempBuf), "Up:%4lud%2luh%2lum T:--Error--", d, h, m);
  }
  u8g2.drawStr(0, 23, upTempBuf);

  long rssi = WiFi.RSSI();
  uint32_t freeHeap = ESP.getFreeHeap();
  uint32_t totalHeap = ESP.getHeapSize();

  int sigBarW = 0;
  if (rssi >= -40) sigBarW = 79;
  else if (rssi <= -100) sigBarW = 0;
  else sigBarW = (int)((rssi + 100) * 79 / 60);
  u8g2.drawStr(0, 31, "Sig:");
  u8g2.drawFrame(25, 24, 103, 8);
  if (sigBarW > 0) u8g2.drawBox(26, 25, sigBarW, 6);

